Repository: mamanonlineschoolforkids-web/Backend
Catalog: Code/Maman.Solution/Maman.Localization/SharedResource.*.resx
Languages: ar

# EmailAlreadyExists
source: Email address already exists
ar: البريد الإلكتروني موجود بالفعل

source: Phone number already exists
ar: رقم الهاتف موجود بالفعل

# RegistrationSuccessful
source: Registration successful. Please check your email to verify your account.
ar: تم التسجيل بنجاح. يرجى التحقق من بريدك الإلكتروني للتحقق من حسابك.

# RegistrationFailed
source: Registration failed. Please try again.
ar: فشل التسجيل. يرجى المحاولة مرة أخرى.

# InvalidCredentials
source: Invalid email or password
ar: البريد الإلكتروني أو كلمة المرور غير صحيحة

# AccountLockedOut
source: Account is locked until {0}. Too many failed login attempts.
ar: الحساب مقفل حتى {0}. محاولات تسجيل دخول فاشلة كثيرة.

# AccountDeleted
source: This account has been deleted
ar: تم حذف هذا الحساب

# AccountSuspended
source: This account has been suspended. Please contact support.
ar: تم تعليق هذا الحساب. يرجى الاتصال بالدعم.

# EmailNotVerified
source: Please verify your email address before logging in
ar: يرجى التحقق من بريدك الإلكتروني قبل تسجيل الدخول

# TwoFactorCodeRequired
source: Two-factor authentication code is required
ar: رمز المصادقة الثنائية مطلوب

# InvalidTwoFactorCode
source: Invalid two-factor authentication code
ar: رمز المصادقة الثنائية غير صحيح

source: Login successful
ar: تم تسجيل الدخول بنجاح

# LoginFailed
source: Login failed. Please try again.
ar: فشل تسجيل الدخول. يرجى المحاولة مرة أخرى.

source: Invalid Google token
ar: رمز جوجل غير صالح

# GoogleLoginFailed
source: Google login failed. Please try again.
ar: فشل تسجيل الدخول عبر جوجل. يرجى المحاولة مرة أخرى.

# AccountNotActive
source: This account is not active
ar: هذا الحساب غير نشط

# InvalidRefreshToken
source: Invalid or expired refresh token
ar: رمز التحديث غير صالح أو منتهي الصلاحية

source: User not found
ar: لم يتم العثور على المستخدم

source: Token refresh failed
ar: فشل تحديث الرمز

# TokenRevoked
source: Token revoked successfully
ar: تم إلغاء الرمز بنجاح

# TokenRevokeFailed
source: Failed to revoke token
ar: فشل إلغاء الرمز

source: Logout successful
ar: تم تسجيل الخروج بنجاح

source: Logout failed
ar: فشل تسجيل الخروج

# PasswordResetEmailSent
source: If your email exists in our system, you will receive a password reset link shortly.
ar: إذا كان بريدك الإلكتروني موجودًا في نظامنا، ستتلقى رابط إعادة تعيين كلمة المرور قريبًا.

source: Password reset request failed
ar: فشل طلب إعادة تعيين كلمة المرور

source: Invalid or expired token
ar: رمز غير صالح أو منتهي الصلاحية

# PasswordResetSuccessful
source: Password reset successful. You can now login with your new password.
ar: تم إعادة تعيين كلمة المرور بنجاح. يمكنك الآن تسجيل الدخول بكلمة المرور الجديدة.

source: Password reset failed
ar: فشل إعادة تعيين كلمة المرور

# EmailAlreadyVerified
source: Email is already verified
ar: تم التحقق من البريد الإلكتروني بالفعل

source: Email verified successfully
ar: تم التحقق من البريد الإلكتروني بنجاح

source: Email verification failed
ar: فشل التحقق من البريد الإلكتروني

# VerificationEmailResent
source: Verification email has been resent
ar: تم إعادة إرسال بريد التحقق

# ResendVerificationFailed
source: Failed to resend verification email
ar: فشل إعادة إرسال بريد التحقق

source: Invalid password
ar: كلمة المرور غير صالحة

# TwoFactorAlreadyEnabled
source: Two-factor authentication is already enabled
ar: المصادقة الثنائية مفعلة بالفعل

# TwoFactorSetupInitiated
source: Two-factor authentication setup initiated. Please scan the QR code with your authenticator app.
ar: تم بدء إعداد المصادقة الثنائية. يرجى مسح رمز QR باستخدام تطبيق المصادقة.

# TwoFactorEnableFailed
source: Failed to enable two-factor authentication
ar: فشل تفعيل المصادقة الثنائية

# TwoFactorNotSetup
source: Two-factor authentication is not set up
ar: المصادقة الثنائية غير معدة

# TwoFactorEnabled
source: Two-factor authentication enabled successfully
ar: تم تفعيل المصادقة الثنائية بنجاح

# TwoFactorVerifyFailed
source: Failed to verify two-factor authentication
ar: فشل التحقق من المصادقة الثنائية

# TwoFactorNotEnabled
source: Two-factor authentication is not enabled
ar: المصادقة الثنائية غير مفعلة

# TwoFactorDisabled
source: Two-factor authentication disabled successfully
ar: تم تعطيل المصادقة الثنائية بنجاح

# TwoFactorDisableFailed
source: Failed to disable two-factor authentication
ar: فشل تعطيل المصادقة الثنائية

# GetProfileFailed
source: Failed to get profile
ar: فشل في الحصول على الملف الشخصي

source: Profile updated successfully
ar: تم تحديث الملف الشخصي بنجاح

# UpdateProfileFailed
source: Failed to update profile
ar: فشل في تحديث الملف الشخصي

# InvalidCurrentPassword
source: Current password is incorrect
ar: كلمة المرور الحالية غير صحيحة

# PasswordChangedSuccessfully
source: Password changed successfully. You have been logged out from all devices.
ar: تم تغيير كلمة المرور بنجاح. لقد تم تسجيل خروجك من جميع الأجهزة.

# PasswordChangeFailed
source: Failed to change password
ar: فشل في تغيير كلمة المرور

# InvalidFileType
source: Invalid file type. Only JPG, JPEG, PNG, and GIF are allowed.
ar: نوع الملف غير صالح. يُسمح فقط بـ JPG و JPEG و PNG و GIF.

# FileTooLarge
source: File size exceeds 5MB limit
ar: حجم الملف يتجاوز الحد المسموح به وهو 5 ميجابايت

source: Profile picture uploaded successfully
ar: تم تحميل صورة الملف الشخصي بنجاح

# ProfilePictureUploadFailed
source: Failed to upload profile picture
ar: فشل في تحميل صورة الملف الشخصي

# AccountDeletionScheduled
source: Your account has been scheduled for deletion. You have 30 days to restore it.
ar: تم جدولة حذف حسابك. لديك 30 يوماً لاستعادته.

# AccountDeletionFailed
source: Failed to delete account
ar: فشل في حذف الحساب

# AccountNotDeleted
source: Account is not deleted
ar: الحساب غير محذوف

# AccountCannotBeRestored
source: Account cannot be restored. The 30-day window has passed.
ar: لا يمكن استعادة الحساب. لقد مرّت فترة الـ 30 يوماً.

source: Account restored successfully
ar: تم استعادة الحساب بنجاح

# AccountRestoreFailed
source: Failed to restore account
ar: فشل في استعادة الحساب

source: User permanently deleted
ar: تم حذف المستخدم نهائياً

# PermanentDeletionFailed
source: Failed to permanently delete user
ar: فشل في حذف المستخدم نهائياً

source: Profile shared successfully
ar: تمت مشاركة الملف الشخصي بنجاح

# ProfileShareFailed
source: Failed to share profile
ar: فشل في مشاركة الملف الشخصي

# GetUsersFailed
source: Failed to get users list
ar: فشل في الحصول على قائمة المستخدمين

# VerificaionTokenRequired
source: Verification Token Required
ar: حقل ال token مطلوب

source: Email or phone number already exists
ar: البريد الالكتروني او الهاتف تم استخدامهم من قبل
